app/views/home/index.html.erb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  <ul>
    <% Tweet.find_each do |tweet| %>