app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["body", "primult post"], ["created_at", "2023-03-04 13:04:35.456708"], ["updated_at", "2023-03-04 13:04:35.456708"]]
---
  def create
    tweet = Tweet.new(tweet_params.merge(user: current_user))

    if tweet.save